/*
 * Copyright (c) 2018-2022 Apple Inc. All rights reserved.
 *
 * @APPLE_OSREFERENCE_LICENSE_HEADER_START@
 *
 * This file contains Original Code and/or Modifications of Original Code
 * as defined in and that are subject to the Apple Public Source License
 * Version 2.0 (the 'License'). You may not use this file except in
 * compliance with the License. The rights granted to you under the License
 * may not be used to create, or enable the creation or redistribution of,
 * unlawful or unlicensed copies of an Apple operating system, or to
 * circumvent, violate, or enable the circumvention or violation of, any
 * terms of an Apple operating system software license agreement.
 *
 * Please obtain a copy of the License at
 * http://www.opensource.apple.com/apsl/ and read it before using this file.
 *
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 *
 * @APPLE_OSREFERENCE_LICENSE_HEADER_END@
 */

/*
 * AppleH1CLCD.cpp
 * H1 Chip LCD Controller Driver
 * Supports:
 * - Apple H1 (343S00437) display controller
 * - Apple H1 (343S00289) display controller

#define INTERFACE_DPI                    2   /* Display Pixel Interface */
#define INTERFACE_EDP                    3   /* Embedded DisplayPort */
#define INTERFACE_HDMI                   4   /* HDMI */

/* Color Formats */
#define COLOR_FORMAT_RGB565              0
#define COLOR_FORMAT_RGB888              1
#define COLOR_FORMAT_ARGB8888             2
#define COLOR_FORMAT_XRGB8888             3
#define COLOR_FORMAT_YUV422               4
#define COLOR_FORMAT_YUV420               5
#define COLOR_FORMAT_P3                   6   /* DCI-P3 */
#define COLOR_FORMAT_DISPLAY_P3            7   /* Display P3 */
#define COLOR_FORMAT_BT2020               8   /* Rec. 2020 */

/* Color Depths */
#define COLOR_DEPTH_8BIT                 8
#define COLOR_DEPTH_10BIT                 10
#define COLOR_DEPTH_12BIT                 12
#define COLOR_DEPTH_16BIT                 16

/* HDR Modes */
#define HDR_MODE_OFF                     0
#define HDR_MODE_HDR10                    1
#define HDR_MODE_HLG                      2
#define HDR_MODE_DOLBY_VISION             3

/* ProMotion Refresh Rates */
#define REFRESH_1HZ                       1
#define REFRESH_10HZ                      10
#define REFRESH_24HZ                      24
#define REFRESH_30HZ                      30
#define REFRESH_48HZ                      48
#define REFRESH_60HZ                      60
#define REFRESH_90HZ                      90
#define REFRESH_120HZ                     120
#define REFRESH_240HZ                     240
#define REFRESH_VARIABLE                  0xFF

/* Brightness Levels */
#define BRIGHTNESS_MIN                    0
#define BRIGHTNESS_MAX                    100
#define BRIGHTNESS_DEFAULT                50

/* Display Power States */
#define DISPLAY_POWER_OFF                0
#define DISPLAY_POWER_SLEEP               1
#define DISPLAY_POWER_LOW_POWER            2
#define DISPLAY_POWER_ON                   3
#define DISPLAY_POWER_MAX                  3

/* Display Control Flags */
#define DISPLAY_FLAG_ENABLE               (1 << 0)
#define DISPLAY_FLAG_BL_ENABLE             (1 << 1)  /* Backlight enable */
#define DISPLAY_FLAG_HDR_ENABLE            (1 << 2)
#define DISPLAY_FLAG_PROMOTION_ENABLE      (1 << 3)  /* ProMotion enable */
#define DISPLAY_FLAG_AOD_ENABLE            (1 << 4)  /* Always-On Display */
#define DISPLAY_FLAG_TRUETONE_ENABLE       (1 << 5)
#define DISPLAY_FLAG_NIGHT_SHIFT_ENABLE    (1 << 6)
#define DISPLAY_FLAG_COLOR_FILTER_ENABLE   (1 << 7)
#define DISPLAY_FLAG_HW_OFFLOAD            (1 << 8)  /* Hardware offload */

/* Panel Status */
#define PANEL_STATUS_OK                  0
#define PANEL_STATUS_DEGRADED             1
#define PANEL_STATUS_BURN_IN              2
#define PANEL_STATUS_STUCK_PIXELS         3
#define PANEL_STATUS_DEAD_PIXELS          4
#define PANEL_STATUS_OVERHEAT              5
#define PANEL_STATUS_UNREACHABLE          6

/*==============================================================================
 * H1 CLCD Register Map
 *==============================================================================*/

struct h1clcd_registers {
    /* Identification (0x0000-0x00FF) */
    uint32_t    chip_id;                    /* 0x0000 - Chip ID */
    uint32_t    chip_revision;               /* 0x0004 - Chip revision */
    uint32_t    fw_version;                  /* 0x0008 - Firmware version */
    uint32_t    bootloader_version;          /* 0x000C - Bootloader version */
    uint32_t    capabilities;                 /* 0x0010 - Capability flags */
    uint32_t    features;                     /* 0x0014 - Feature flags */
    uint32_t    reserved_018[10];            /* 0x0018-0x003F */
    
    /* Display Control (0x0040-0x00FF) */
    uint32_t    display_enable;               /* 0x0040 - Display enable */
    uint32_t    display_status;               /* 0x0044 - Display status */
    uint32_t    display_mode;                  /* 0x0048 - Display mode */
    uint32_t    display_format;                /* 0x004C - Display format */
    uint32_t    display_timing;                /* 0x0050 - Display timing */
    uint32_t    reserved_054[11];             /* 0x0054-0x007F */
    
    /* Panel Control (0x0080-0x00FF) */
    uint32_t    panel_type;                    /* 0x0080 - Panel type */
    uint32_t    panel_vendor;                  /* 0x0084 - Panel vendor */
    uint32_t    panel_info;                    /* 0x0088 - Panel information */
    uint32_t    panel_status;                  /* 0x008C - Panel status */
    uint32_t    panel_temperature;              /* 0x0090 - Panel temperature */
    uint32_t    panel_age;                      /* 0x0094 - Panel age (hours) */
    uint32_t    reserved_098[26];              /* 0x0098-0x00FF */
    
    /* Resolution (0x0100-0x01FF) */
    uint32_t    h_active;                      /* 0x0100 - Horizontal active pixels */
    uint32_t    h_blank;                       /* 0x0104 - Horizontal blanking */
    uint32_t    h_front_porch;                 /* 0x0108 - Horizontal front porch */
    uint32_t    h_sync_width;                  /* 0x010C - Horizontal sync width */
    uint32_t    h_back_porch;                  /* 0x0110 - Horizontal back porch */
    uint32_t    v_active;                      /* 0x0114 - Vertical active lines */
    uint32_t    v_blank;                       /* 0x0118 - Vertical blanking */
    uint32_t    v_front_porch;                 /* 0x011C - Vertical front porch */
    uint32_t    v_sync_width;                  /* 0x0120 - Vertical sync width */
    uint32_t    v_back_porch;                  /* 0x0124 - Vertical back porch */
    uint32_t    pixel_clock;                    /* 0x0128 - Pixel clock (Hz) */
    uint32_t    refresh_rate;                   /* 0x012C - Refresh rate (mHz) */
    uint32_t    reserved_130[52];              /* 0x0130-0x01FF */
    
    /* Color Control (0x0200-0x02FF) */
    uint32_t    color_format;                   /* 0x0200 - Color format */
    uint32_t    color_depth;                    /* 0x0204 - Color depth */
    uint32_t    color_gamut;                    /* 0x0208 - Color gamut */
    uint32_t    hdr_mode;                       /* 0x020C - HDR mode */
    uint32_t    brightness;                      /* 0x0210 - Brightness level */
    uint32_t    contrast;                       /* 0x0214 - Contrast level */
    uint32_t    saturation;                      /* 0x0218 - Saturation level */
    uint32_t    hue;                            /* 0x021C - Hue level */
    uint32_t    gamma_r;                        /* 0x0220 - Red gamma */
    uint32_t    gamma_g;                        /* 0x0224 - Green gamma */
    uint32_t    gamma_b;                        /* 0x0228 - Blue gamma */
    uint32_t    whitepoint;                      /* 0x022C - Whitepoint */
    uint32_t    reserved_230[52];               /* 0x0230-0x02FF */
    
    /* Backlight Control (0x0300-0x03FF) */
    uint32_t    backlight_enable;                /* 0x0300 - Backlight enable */
    uint32_t    backlight_pwm;                   /* 0x0304 - Backlight PWM value */
    uint32_t    backlight_current;               /* 0x0308 - Backlight current */
    uint32_t    backlight_voltage;               /* 0x030C - Backlight voltage */
    uint32_t    backlight_power;                  /* 0x0310 - Backlight power (mW) */
    uint32_t    backlight_temperature;            /* 0x0314 - Backlight temperature */
    uint32_t    reserved_318[58];                /* 0x0318-0x03FF */
    
    /* Power Management (0x0400-0x04FF) */
    uint32_t    power_state;                      /* 0x0400 - Power state */
    uint32_t    power_flags;                      /* 0x0404 - Power flags */
    uint32_t    voltage_core;                     /* 0x0408 - Core voltage (mV) */
    uint32_t    voltage_io;                       /* 0x040C - IO voltage (mV) */
    uint32_t    voltage_pll;                      /* 0x0410 - PLL voltage (mV) */
    uint32_t    current_core;                     /* 0x0414 - Core current (mA) */
    uint32_t    power_consumption;                /* 0x0418 - Power consumption (mW) */
    uint32_t    temperature;                      /* 0x041C - Die temperature */
    uint32_t    throttle_level;                   /* 0x0420 - Throttle level (0-100) */
    uint32_t    reserved_424[55];                 /* 0x0424-0x04FF */
    
    /* Interrupt Control (0x0500-0x05FF) */
    uint32_t    int_status;                       /* 0x0500 - Interrupt status */
    uint32_t    int_enable;                       /* 0x0504 - Interrupt enable */
    uint32_t    int_clear;                        /* 0x0508 - Interrupt clear */
    uint32_t    int_mask;                         /* 0x050C - Interrupt mask */
    uint32_t    reserved_510[60];                 /* 0x0510-0x05FF */
    
    /* DMA Control (0x0600-0x06FF) */
    uint32_t    dma_enable;                       /* 0x0600 - DMA enable */
    uint32_t    dma_status;                       /* 0x0604 - DMA status */
    uint32_t    dma_fb_address;                   /* 0x0608 - Framebuffer address */
    uint32_t    dma_fb_size;                      /* 0x060C - Framebuffer size */
    uint32_t    dma_line_stride;                  /* 0x0610 - Line stride */
    uint32_t    dma_underflow;                    /* 0x0614 - Underflow count */
    uint32_t    dma_overflow;                     /* 0x0618 - Overflow count */
    uint32_t    reserved_61C[56];                 /* 0x061C-0x06FF */
    
    /* MIPI DSI Control (0x0700-0x07FF) */
    uint32_t    dsi_enable;                       /* 0x0700 - DSI enable */
    uint32_t    dsi_status;                       /* 0x0704 - DSI status */
    uint32_t    dsi_lanes;                        /* 0x0708 - Active lanes */
    uint32_t    dsi_bitrate;                      /* 0x070C - Bitrate per lane */
    uint32_t    dsi_video_mode;                   /* 0x0710 - Video mode */
    uint32_t    dsi_command_mode;                 /* 0x0714 - Command mode */
    uint32_t    reserved_718[58];                 /* 0x0718-0x07FF */
    
    /* Debug (0x0F00-0x0FFF) */
    uint32_t    debug_control;                    /* 0x0F00 - Debug control */
    uint32_t    debug_status;                     /* 0x0F04 - Debug status */
    uint32_t    debug_data[63];                   /* 0x0F08-0x0FFC */
};

/* Interrupt bits */
#define INT_VSYNC                     (1 << 0)
#define INT_HSYNC                     (1 << 1)
#define INT_UNDERFLOW                 (1 << 2)
#define INT_OVERFLOW                  (1 << 3)
#define INT_TE                        (1 << 4)  /* Tearing effect */
#define INT_PANEL_CHANGE              (1 << 5)
#define INT_POWER_CHANGE              (1 << 6)
#define INT_THERMAL_WARNING           (1 << 7)
#define INT_THERMAL_CRITICAL          (1 << 8)
#define INT_BACKLIGHT_FAIL            (1 << 9)
#define INT_ALL                       (0xFFFFFFFF)

/* Capability bits */
#define CAP_HDR                       (1 << 0)
#define CAP_PROMOTION                 (1 << 1)
#define CAP_AOD                       (1 << 2)
#define CAP_TRUETONE                  (1 << 3)
#define CAP_NIGHT_SHIFT               (1 << 4)
#define CAP_COLOR_FILTER              (1 << 5)
#define CAP_HW_OFFLOAD                (1 << 6)
